In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])
table

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [3]:
table_null = table.copy()
table_null['ID'] = np.nan
table_null

   ID      City  Birth_year     Name
a NaN     Tokyo        1990  Hiroshi
b NaN     Osaka        1989    Akiki
c NaN     Kyoto        1992     Yuki
d NaN  Hokkaido        1997   Satoru
e NaN     Tokyo        1982    Steve

### 單條件

In [4]:
mask = table['City']=='Tokyo'
print(mask)

table[mask]

a     True
b    False
c    False
d    False
e     True
Name: City, dtype: bool

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
e  104  Tokyo        1982    Steve

In [5]:
mask = table['City'].isin(['Tokyo'])
print(mask)
table[mask]

a     True
b    False
c    False
d    False
e     True
Name: City, dtype: bool

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
e  104  Tokyo        1982    Steve

In [6]:
mask = table.isin(['Tokyo'])
print(mask)
table[mask]

      ID   City  Birth_year   Name
a  False   True       False  False
b  False  False       False  False
c  False  False       False  False
d  False  False       False  False
e  False   True       False  False

    ID   City  Birth_year Name
a  NaN  Tokyo         NaN  NaN
b  NaN    NaN         NaN  NaN
c  NaN    NaN         NaN  NaN
d  NaN    NaN         NaN  NaN
e  NaN  Tokyo         NaN  NaN

### 多條件

In [7]:
mask1 = table['City']=='Tokyo'
mask2 = table['Birth_year']>1985 
print(mask1)
print(mask2)

table[mask1 & mask2]

a     True
b    False
c    False
d    False
e     True
Name: City, dtype: bool
a     True
b     True
c     True
d     True
e    False
Name: Birth_year, dtype: bool

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi

In [8]:
mask1 = table['City']=='Tokyo'
mask2 = table['Birth_year']>1990 
print(mask1)
print(mask2)

table[mask1 | mask2]

a     True
b    False
c    False
d    False
e     True
Name: City, dtype: bool
a    False
b    False
c     True
d     True
e    False
Name: Birth_year, dtype: bool

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

### nan/null 判定

In [9]:
table_null.isnull()

     ID   City  Birth_year   Name
a  True  False       False  False
b  True  False       False  False
c  True  False       False  False
d  True  False       False  False
e  True  False       False  False

In [10]:
table_null['ID'].isnull()

a    True
b    True
c    True
d    True
e    True
Name: ID, dtype: bool

In [11]:
table_null.isnull().sum()

ID            5
City          0
Birth_year    0
Name          0
dtype: int64